{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "a3406b7d",
      "metadata": {
        "id": "a3406b7d"
      },
      "source": [
        "# Model evaluation notebook"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Jupyter version\n",
        "import ipywidgets as widgets\n",
        "from IPython.display import display\n",
        "\n",
        "model_list = [\n",
        "  \"gemma2:2b\",\n",
        "  \"gemma2:9b\",\n",
        "  \"gemma3:12b\",\n",
        "  \"mistral:7b\",\n",
        "  \"mixtral:8x7b\",\n",
        "  \"phi:2.7b\",\n",
        "  \"phi4:14b\",\n",
        "  \"deepseek-r1:7b\",\n",
        "]\n",
        "model_picker = widgets.Dropdown(options=model_list)\n",
        "\n",
        "# GColab version\n",
        "MODEL = 'phi4:14b' # @param [\"gemma2:2b\", \"gemma2:9b\", \"gemma3:12b\", \"mistral:7b\", \"mixtral:8x7b\", \"phi:2.7b\", \"phi4:14b\", \"deepseek-r1:7b\"] {allow-input: true}\n",
        "MODEL"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 36
        },
        "id": "dPqIJib05A9c",
        "outputId": "c4f18ca0-686d-44eb-a9c2-7fc204701c8b"
      },
      "id": "dPqIJib05A9c",
      "execution_count": 1,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "'phi4:14b'"
            ],
            "application/vnd.google.colaboratory.intrinsic+json": {
              "type": "string"
            }
          },
          "metadata": {},
          "execution_count": 1
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Start time\n",
        "!date"
      ],
      "metadata": {
        "id": "1sQhHMM3hH56",
        "outputId": "63ab32dc-e262-4b03-dd7e-e0f0cf0ef459",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "id": "1sQhHMM3hH56",
      "execution_count": 2,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Wed Apr 30 03:04:50 PM UTC 2025\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Setup"
      ],
      "metadata": {
        "id": "_xDYWzO-Yayb"
      },
      "id": "_xDYWzO-Yayb"
    },
    {
      "cell_type": "code",
      "source": [
        "from getpass import getpass\n",
        "\n",
        "def get_secret(prompt, secret_name, secret_input=True):\n",
        "  try:\n",
        "    from google.colab import userdata\n",
        "    result = userdata.get(secret_name)\n",
        "    assert result is not None\n",
        "  except:\n",
        "    if secret_input:\n",
        "      result = getpass(prompt)\n",
        "    else:\n",
        "      result = input(prompt)\n",
        "  return result\n"
      ],
      "metadata": {
        "id": "oZ3dny5NzRvz"
      },
      "id": "oZ3dny5NzRvz",
      "execution_count": 3,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Install required libraries"
      ],
      "metadata": {
        "id": "nlO-cFvcrGbi"
      },
      "id": "nlO-cFvcrGbi"
    },
    {
      "cell_type": "code",
      "source": [
        "%%capture\n",
        "import os\n",
        "if \"COLAB_\" not in \"\".join(os.environ.keys()):\n",
        "    !pip install unsloth\n",
        "else:\n",
        "    # Do this only in Colab notebooks! Otherwise use pip install unsloth\n",
        "    !pip install --no-deps bitsandbytes accelerate xformers==0.0.29.post3 peft trl==0.15.2 triton cut_cross_entropy unsloth_zoo\n",
        "    !pip install sentencepiece protobuf datasets huggingface_hub hf_transfer\n",
        "    !pip install --no-deps unsloth\n",
        "    !pip install -U transformers"
      ],
      "metadata": {
        "id": "JqVfnROiLBuM"
      },
      "id": "JqVfnROiLBuM",
      "execution_count": 4,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "!pip install wandb -qU\n",
        "!uv pip install -q bitsandbytes transformers peft accelerate datasets scipy einops evaluate trl rouge_score numpy"
      ],
      "metadata": {
        "id": "IU9NpO2KrF7R"
      },
      "id": "IU9NpO2KrF7R",
      "execution_count": 5,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# Log in to your W&B account\n",
        "import wandb\n",
        "import random\n",
        "import math\n",
        "import os"
      ],
      "metadata": {
        "id": "LqZV62kKrcP-"
      },
      "id": "LqZV62kKrcP-",
      "execution_count": 6,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "wandb.login(key=get_secret('W&B key: ', 'TFM_WAND_TOKEN'))"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "b_SvJujbrd_8",
        "outputId": "57a0c959-087c-4958-cfe6-48f663eb0597"
      },
      "id": "b_SvJujbrd_8",
      "execution_count": 7,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "\u001b[34m\u001b[1mwandb\u001b[0m: \u001b[33mWARNING\u001b[0m If you're specifying your api key in code, ensure this code is not shared publicly.\n",
            "\u001b[34m\u001b[1mwandb\u001b[0m: \u001b[33mWARNING\u001b[0m Consider setting the WANDB_API_KEY environment variable, or running `wandb login` from the command line.\n",
            "\u001b[34m\u001b[1mwandb\u001b[0m: Appending key for api.wandb.ai to your netrc file: /root/.netrc\n",
            "\u001b[34m\u001b[1mwandb\u001b[0m: Currently logged in as: \u001b[33msergiomportela\u001b[0m (\u001b[33msergiomportela-universitat-oberta-de-catalunya\u001b[0m) to \u001b[32mhttps://api.wandb.ai\u001b[0m. Use \u001b[1m`wandb login --relogin`\u001b[0m to force relogin\n"
          ]
        },
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "True"
            ]
          },
          "metadata": {},
          "execution_count": 7
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "os.environ[\"WANDB_PROJECT\"] = \"fine-tune-tfm-2025-tests\"  # name your W&B project\n",
        "os.environ[\"WANDB_LOG_MODEL\"] = \"checkpoint\"  # log all model checkpoints"
      ],
      "metadata": {
        "id": "2_Ug2dz4rhJc"
      },
      "id": "2_Ug2dz4rhJc",
      "execution_count": 8,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "from datasets import load_dataset\n",
        "\n",
        "from transformers import (\n",
        "    AutoModelForCausalLM,\n",
        "    AutoTokenizer,\n",
        "    BitsAndBytesConfig,\n",
        "    HfArgumentParser,\n",
        "    AutoTokenizer,\n",
        "    TrainingArguments,\n",
        "    Trainer,\n",
        "    GenerationConfig\n",
        ")\n",
        "from tqdm import tqdm\n",
        "from trl import SFTTrainer\n",
        "import torch\n",
        "import time\n",
        "import pandas as pd\n",
        "import numpy as np\n",
        "from huggingface_hub import interpreter_login\n",
        "from huggingface_hub import login as hf_login\n",
        "\n",
        "hf_login(token=get_secret('Hugging Face token: ', 'TFM_HUGGINGFACE_TOKEN'))"
      ],
      "metadata": {
        "id": "zHIwyuEqrln4"
      },
      "id": "zHIwyuEqrln4",
      "execution_count": 9,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "id": "22002ef2-6649-45fd-8352-52104f456f98",
      "metadata": {
        "id": "22002ef2-6649-45fd-8352-52104f456f98"
      },
      "source": [
        "### Prepare code"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 10,
      "id": "544f2f5c-c999-43fb-b8a1-21294ebb08fb",
      "metadata": {
        "id": "544f2f5c-c999-43fb-b8a1-21294ebb08fb"
      },
      "outputs": [],
      "source": [
        "import os\n",
        "\n",
        "if not os.path.exists('src'):\n",
        "  import urllib\n",
        "\n",
        "  user = get_secret('User name: ', 'TFM_GH_USER')\n",
        "  password = get_secret('Password: ', 'TFM_GH_TOKEN')\n",
        "  password = urllib.parse.quote(password) # your password is converted into url format\n",
        "  repopath = \"tfm-smp-2025/fine-tuning\"\n",
        "\n",
        "  !git clone https://\"$user\":\"$password\"@github.com/\"$repopath\" src\n",
        "\n",
        "  del password"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Update code, if needed\n",
        "!cd src && git pull"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "ccqEW_Hl7K79",
        "outputId": "00cd92a4-4f92-4ff0-931d-dad11ddf38f4"
      },
      "id": "ccqEW_Hl7K79",
      "execution_count": 11,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Already up to date.\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "#### Credentials"
      ],
      "metadata": {
        "id": "GByJJ-qSbYmx"
      },
      "id": "GByJJ-qSbYmx"
    },
    {
      "cell_type": "markdown",
      "source": [
        "##### Result pusher setup"
      ],
      "metadata": {
        "id": "plEBsG9meCvj"
      },
      "id": "plEBsG9meCvj"
    },
    {
      "cell_type": "code",
      "source": [
        "import os\n",
        "\n",
        "if (\n",
        "    (not os.path.exists(os.path.expanduser(\"~/.ssh/id_rsa\")))\n",
        "    or (not os.path.exists(os.path.expanduser(\"~/.ssh/known_hosts\")))\n",
        "):\n",
        "  SSHKEY = get_secret('Result pusher SSH key: ', 'TFM_SSH_PUSHER_KEY')\n",
        "\n",
        "  !mkdir ~/.ssh\n",
        "\n",
        "  # Read locally with `cat ~/.ssh/result-pusher|tr '\\n' '$';echo`\n",
        "  with open(os.path.expanduser(\"~/.ssh/id_rsa\"), 'wt') as f:\n",
        "    f.write(SSHKEY.replace('$', '\\n'))\n",
        "\n",
        "  !chmod 0600 ~/.ssh/id_rsa\n",
        "  !ssh-keygen -y -f ~/.ssh/id_rsa > ~/.ssh/id_rsa.pub\n",
        "  !chmod 0600 ~/.ssh/id_rsa.pub\n",
        "\n",
        "  # This won't copy the client key (not needed), but it will initialize the server's on the client\n",
        "  !ssh-copy-id -i ~/.ssh/id_rsa -o StrictHostKeyChecking=accept-new result-pusher@kb.tfm.codigoparallevar.com\n",
        "\n",
        "  del SSHKEY"
      ],
      "metadata": {
        "id": "rkFM-Yd5eFhd"
      },
      "id": "rkFM-Yd5eFhd",
      "execution_count": 12,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Pull datasets"
      ],
      "metadata": {
        "id": "sZS0n93jC6B2"
      },
      "id": "sZS0n93jC6B2"
    },
    {
      "cell_type": "code",
      "source": [
        "# !python3 src/scripts/pull_datasets.py"
      ],
      "metadata": {
        "id": "pqqvRJAIC4dl"
      },
      "id": "pqqvRJAIC4dl",
      "execution_count": 13,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "id": "978e116d-b24b-4752-9ded-145d88e46209",
      "metadata": {
        "id": "978e116d-b24b-4752-9ded-145d88e46209"
      },
      "source": [
        "## Run fine tuning"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "compute_dtype = getattr(torch, \"float16\")\n",
        "bnb_config = BitsAndBytesConfig(\n",
        "        load_in_4bit=True,\n",
        "        bnb_4bit_quant_type='nf4',\n",
        "        bnb_4bit_compute_dtype=compute_dtype,\n",
        "        bnb_4bit_use_double_quant=False,\n",
        "    )"
      ],
      "metadata": {
        "id": "6muhkiHDYvWC"
      },
      "id": "6muhkiHDYvWC",
      "execution_count": 14,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "from unsloth import FastLanguageModel  # FastVisionModel for LLMs\n",
        "\n",
        "model_name='microsoft/phi-4'\n",
        "model_name = 'unsloth/Phi-4'  # Unsloth's version\n",
        "model_name = \"unsloth/Phi-4-unsloth-bnb-4bit\"  # Phi-4 Unsloth Dynamic 4-bit Quant\n",
        "device_map = {\"\": 0}\n",
        "\n",
        "\n",
        "model, tokenizer = FastLanguageModel.from_pretrained(\n",
        "    model_name = \"unsloth/Phi-4\",\n",
        "    max_seq_length = 16384, # max_seq_length,\n",
        "    load_in_4bit = True, # load_in_4bit,\n",
        "    # token = \"hf_...\", # use one if using gated models like meta-llama/Llama-2-7b-hf\n",
        ")"
      ],
      "metadata": {
        "id": "RaA5vvvDBD21",
        "outputId": "9d3077a6-4006-4df3-fb83-d06f51b5679b",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 277,
          "referenced_widgets": [
            "b59be6e88db245678ec4619c637e9cdc",
            "741e765697874f73844b1ea34d38e8e1",
            "f94a0790662a4cb4a7343de003010e17",
            "eaad1e2eaa5744d58a628e4ddd9c9c50",
            "e136d8a5bbc24a6d8f4cf52b63ca5c8a",
            "f770eb5ba6d3488aa8830ea2baab22bf",
            "dcafc58ae9c445f0b98d2c664d4de289",
            "482dc54f84794b1097c93d1e91f1c12a",
            "78d3f17bf3bf48e286ef04d29c7b36b7",
            "66da8149c5f14337b6e5d4d4a8a0b48d",
            "791594b027314e2180eb125f1d9ce83e"
          ]
        }
      },
      "id": "RaA5vvvDBD21",
      "execution_count": 15,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "🦥 Unsloth: Will patch your computer to enable 2x faster free finetuning.\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "<ipython-input-15-7e92c01311be>:1: UserWarning: WARNING: Unsloth should be imported before trl, transformers, peft to ensure all optimizations are applied. Your code may run slower or encounter memory issues without these optimizations.\n",
            "\n",
            "Please restructure your imports with 'import unsloth' at the top of your file.\n",
            "  from unsloth import FastLanguageModel  # FastVisionModel for LLMs\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "🦥 Unsloth Zoo will now patch everything to make training faster!\n",
            "==((====))==  Unsloth 2025.4.3: Fast Llama patching. Transformers: 4.51.3.\n",
            "   \\\\   /|    NVIDIA A100-SXM4-40GB. Num GPUs = 1. Max memory: 39.557 GB. Platform: Linux.\n",
            "O^O/ \\_/ \\    Torch: 2.6.0+cu124. CUDA: 8.0. CUDA Toolkit: 12.4. Triton: 3.2.0\n",
            "\\        /    Bfloat16 = TRUE. FA [Xformers = 0.0.29.post3. FA2 = False]\n",
            " \"-____-\"     Free license: http://github.com/unslothai/unsloth\n",
            "Unsloth: Fast downloading is enabled - ignore downloading bars which are red colored!\n"
          ]
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Loading checkpoint shards:   0%|          | 0/3 [00:00<?, ?it/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "b59be6e88db245678ec4619c637e9cdc"
            }
          },
          "metadata": {}
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "tokenizer = AutoTokenizer.from_pretrained(model_name,trust_remote_code=True,padding_side=\"left\") # ,add_eos_token=True,add_bos_token=True,use_fast=False)\n",
        "tokenizer.pad_token = tokenizer.eos_token"
      ],
      "metadata": {
        "id": "B9sa9ZsxsPqy"
      },
      "id": "B9sa9ZsxsPqy",
      "execution_count": 16,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "import json\n",
        "\n",
        "def load_jsonl(path):\n",
        "  with open(path) as f:\n",
        "    return [\n",
        "      json.loads(line)\n",
        "      for line in f\n",
        "    ]\n",
        "\n",
        "def regen_jsonl(path):\n",
        "  with open(path) as f:\n",
        "    data = [\n",
        "      json.loads(line)\n",
        "      for line in f\n",
        "    ]\n",
        "  with open(path, 'w') as f:\n",
        "    for line in data:\n",
        "      if isinstance(line, list):\n",
        "        f.write(json.dumps({\"messages\": line}) + '\\n')\n",
        "      else:\n",
        "        f.write(json.dumps(line) + '\\n')\n",
        "\n",
        "regen_jsonl(\"fine-tuning-test.jsonl\")\n",
        "regen_jsonl(\"fine-tuning-data.jsonl\")"
      ],
      "metadata": {
        "id": "GTc4b59ZRdAk"
      },
      "id": "GTc4b59ZRdAk",
      "execution_count": 17,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "import json\n",
        "import datasets\n",
        "\n",
        "dataset = datasets.load_dataset(\"json\", data_files={\n",
        "    \"test\": \"fine-tuning-test.jsonl\",\n",
        "    \"train\": \"fine-tuning-data.jsonl\",\n",
        "}, )\n",
        "dataset # ['test'][0]"
      ],
      "metadata": {
        "id": "JL9YVVvPsPoL",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 255,
          "referenced_widgets": [
            "29edc8919f3f4508b706ee040d230da1",
            "86eb63275eec4405bc6d2d265c0d0651",
            "312178a3e0be4e04acfcdd256053252b",
            "80bc44fe9c47426dabbe57919a03ca7f",
            "b605171f7b6644feb8a4222ab922e844",
            "536d78c7ef6f4dafbcb3af2fed46aacc",
            "b956e7445db6496d848a3193b1af10c7",
            "5e8950be6de84bb8a4e55b3f80ab764e",
            "f4e068f92f8448058b488e7d25f14dbf",
            "e9f73c258ffb43e693c523578c427a6c",
            "136c13d5ff7a4e9c874a9a234d3bc7c3",
            "532fbd7cc9d34e2abb98950f8b39c8d1",
            "46528b8a27904a8283bc88141cca02a6",
            "c79731c2874e44f8a0d8c8cd47d6840f",
            "4aa14555124648b7b090588bb1690adf",
            "b818c08cf0204bceb753f602a916e3ae",
            "61f8212b29f84c4ca3a243b28225dff7",
            "75b389d9c72f45f9867c5b7684daa79d",
            "3512c99839914007bc797ca42bc56679",
            "5dca594db99149c18cfff758015fa961",
            "f4e7b58fcfc74158b8b80d9273d41958",
            "45b2c256eb1640eda8d91db0a529cf4b"
          ]
        },
        "outputId": "277fdaf9-c296-40e1-bb0f-db98c62521b0"
      },
      "id": "JL9YVVvPsPoL",
      "execution_count": 18,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Generating test split: 0 examples [00:00, ? examples/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "29edc8919f3f4508b706ee040d230da1"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Generating train split: 0 examples [00:00, ? examples/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "532fbd7cc9d34e2abb98950f8b39c8d1"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "DatasetDict({\n",
              "    test: Dataset({\n",
              "        features: ['messages'],\n",
              "        num_rows: 10\n",
              "    })\n",
              "    train: Dataset({\n",
              "        features: ['messages'],\n",
              "        num_rows: 286\n",
              "    })\n",
              "})"
            ]
          },
          "metadata": {},
          "execution_count": 18
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "!tail -n1 fine-tuning-*.jsonl"
      ],
      "metadata": {
        "id": "idGPLdbaGfYF",
        "outputId": "82797135-d42b-460f-f712-f3433443cd41",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "id": "idGPLdbaGfYF",
      "execution_count": 19,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "==> fine-tuning-data.jsonl <==\n",
            "{\"messages\": [{\"actor\": \"user\", \"text\": \"Extract the nouns from this natural language query.\\n\\n> name the home stadium of FC Spartak Moscow season 2011-12\\n\\nLet's reason step by step. Identify the nouns on the query, skip the ones that can be solved by a SPARQL verb (ignore, for example, \\\"count\\\" or \\\"number of\\\"), and output a json list like this.\\n\\n```json\\n[\\n    \\\"entity1\\\",\\n    \\\"entity2\\\",\\n    ...\\n    \\\"entityN\\\"\\n]\\n```\"}, {\"actor\": \"assistant\", \"text\": \"```json\\n[\\n    \\\"home stadium\\\",\\n    \\\"FC Spartak Moscow season\\\"\\n]\\n```\"}, {\"actor\": \"user\", \"text\": \"\\nThis are some examples on how the available properties can be used:\\n\\n### Subject: <http://dbpedia.org/resource/FC_Spartak_Moscow> ; Predicate: <http://dbpedia.org/property/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/FC_Spartak_Moscow> <http://dbpedia.org/property/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/FC_Spartak_Moscow> ; Predicate: <http://dbpedia.org/ontology/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/FC_Spartak_Moscow> <http://dbpedia.org/ontology/season> ?object }\\n```\\n\\n### Object: <http://dbpedia.org/resource/FC_Spartak_Moscow> ; Predicate: <http://dbpedia.org/ontology/team>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/FC_Spartak_Moscow> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/FC_Spartak_Moscow> ; Predicate: <http://dbpedia.org/property/team>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/property/team> <http://dbpedia.org/resource/FC_Spartak_Moscow> }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2014\\u201315_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/team>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2014\\u201315_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/team> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2014\\u201315_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2014\\u201315_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2014\\u201315_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/property/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2014\\u201315_FC_Spartak_Moscow_season> <http://dbpedia.org/property/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2014\\u201315_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/homeStadium>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2014\\u201315_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2014\\u201315_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/property/stadium>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2014\\u201315_FC_Spartak_Moscow_season> <http://dbpedia.org/property/stadium> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2015\\u201316_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/team>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2015\\u201316_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/team> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2015\\u201316_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2015\\u201316_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2015\\u201316_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/property/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2015\\u201316_FC_Spartak_Moscow_season> <http://dbpedia.org/property/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2015\\u201316_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/homeStadium>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2015\\u201316_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2015\\u201316_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/property/stadium>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2015\\u201316_FC_Spartak_Moscow_season> <http://dbpedia.org/property/stadium> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/team>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/team> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/property/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/property/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/homeStadium>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/property/stadium>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/property/stadium> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2012\\u201313_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/team>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2012\\u201313_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/team> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2012\\u201313_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2012\\u201313_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2012\\u201313_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/property/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2012\\u201313_FC_Spartak_Moscow_season> <http://dbpedia.org/property/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2012\\u201313_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/homeStadium>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2012\\u201313_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2012\\u201313_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/property/stadium>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2012\\u201313_FC_Spartak_Moscow_season> <http://dbpedia.org/property/stadium> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2013\\u201314_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/team>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2013\\u201314_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/team> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2013\\u201314_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2013\\u201314_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2013\\u201314_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/property/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2013\\u201314_FC_Spartak_Moscow_season> <http://dbpedia.org/property/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2013\\u201314_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/ontology/homeStadium>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2013\\u201314_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/2013\\u201314_FC_Spartak_Moscow_season> ; Predicate: <http://dbpedia.org/property/stadium>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/2013\\u201314_FC_Spartak_Moscow_season> <http://dbpedia.org/property/stadium> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/FC_Spartak-2_Moscow> ; Predicate: <http://dbpedia.org/property/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/FC_Spartak-2_Moscow> <http://dbpedia.org/property/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/FC_Spartak-2_Moscow> ; Predicate: <http://dbpedia.org/ontology/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/FC_Spartak-2_Moscow> <http://dbpedia.org/ontology/season> ?object }\\n```\\n\\n### Object: <http://dbpedia.org/resource/FC_Spartak-2_Moscow> ; Predicate: <http://dbpedia.org/ontology/team>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/FC_Spartak-2_Moscow> }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Home_United_FC> ; Predicate: <http://dbpedia.org/property/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Home_United_FC> <http://dbpedia.org/property/season> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Home_United_FC> ; Predicate: <http://dbpedia.org/ontology/season>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Home_United_FC> <http://dbpedia.org/ontology/season> ?object }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Home_United_FC> ; Predicate: <http://dbpedia.org/ontology/team>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Home_United_FC> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Home_United_FC> ; Predicate: <http://dbpedia.org/property/team>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Home_United_FC> }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Stadium_Municipal> ; Predicate: <http://dbpedia.org/property/stadiumName>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Stadium_Municipal> <http://dbpedia.org/property/stadiumName> ?object }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Stadium_Municipal> ; Predicate: <http://dbpedia.org/ontology/homeStadium>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/homeStadium> <http://dbpedia.org/resource/Stadium_Municipal> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Stadium_Municipal> ; Predicate: <http://dbpedia.org/property/stadium>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/property/stadium> <http://dbpedia.org/resource/Stadium_Municipal> }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Home_United_FC__R_Aaravin__1> ; Predicate: <http://dbpedia.org/ontology/team>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Home_United_FC__R_Aaravin__1> <http://dbpedia.org/ontology/team> ?object }\\n```\\n\\nOf the ones given, which predicates will be useful to solve it?\\n\\nConsider it's better to query directly on IRIs and avoid filtering whenever possible. DO NOT generate any query yet.\\n\"}, {\"actor\": \"assistant\", \"text\": \"These are the predicates useful to solve this query:\\n- From subject <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season>, through predicate <http://dbpedia.org/ontology/homeStadium>\\n\"}, {\"actor\": \"user\", \"text\": \"What are the subject IRIs that will be handy to solve this query? STILL DO NOT generate any query yet.\"}, {\"actor\": \"assistant\", \"text\": \"These are the IRIs useful to solve this query:\\n- http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season\\n- http://dbpedia.org/ontology/homeStadium\\n\"}, {\"actor\": \"user\", \"text\": \"\\nConstruct a SPARQL query to solve it on a single query, keep it simple and avoid unnecessary conditions. If it's an item list just do a SELECT, but if it's numeric you might need to use a verb like COUNT(), and if it's boolean you might need to use ASK.\\n\\nRemember to avoid querying by label, use the IRIs and relations presented before, not others. DO NOT even use common types like `name` or `type` unless they were explicitly allowed.\\n\\nQuery to solve:\\n> name the home stadium of FC Spartak Moscow season 2011-12\"}, {\"actor\": \"assistant\", \"text\": \"```sparql\\n SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2011\\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?uri } \\n```\"}]}\n",
            "\n",
            "==> fine-tuning-test.jsonl <==\n",
            "{\"messages\": [{\"actor\": \"user\", \"text\": \"Extract the nouns from this natural language query.\\n\\n> Whose network's parent organisation is Comcast?\\n\\nLet's reason step by step. Identify the nouns on the query, skip the ones that can be solved by a SPARQL verb (ignore, for example, \\\"count\\\" or \\\"number of\\\"), and output a json list like this.\\n\\n```json\\n[\\n    \\\"entity1\\\",\\n    \\\"entity2\\\",\\n    ...\\n    \\\"entityN\\\"\\n]\\n```\"}, {\"actor\": \"assistant\", \"text\": \"```json\\n[\\n    \\\"network\\\",\\n    \\\"parent organisation\\\",\\n    \\\"Comcast\\\"\\n]\\n```\"}, {\"actor\": \"user\", \"text\": \"\\nThis are some examples on how the available properties can be used:\\n\\n### Subject: <http://dbpedia.org/resource/Network_Ten> ; Predicate: <http://dbpedia.org/ontology/broadcastNetwork>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Network_Ten> <http://dbpedia.org/ontology/broadcastNetwork> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Network_Ten> ; Predicate: <http://dbpedia.org/property/broadcastArea>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Network_Ten> <http://dbpedia.org/property/broadcastArea> ?object }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Network_Ten> ; Predicate: <http://dbpedia.org/ontology/broadcastNetwork>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/broadcastNetwork> <http://dbpedia.org/resource/Network_Ten> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Network_Ten> ; Predicate: <http://dbpedia.org/ontology/network>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Network_Ten> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Network_Ten> ; Predicate: <http://dbpedia.org/property/network>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/property/network> <http://dbpedia.org/resource/Network_Ten> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Network_Ten> ; Predicate: <http://dbpedia.org/ontology/formerBroadcastNetwork>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/formerBroadcastNetwork> <http://dbpedia.org/resource/Network_Ten> }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Unison_Networks> ; Predicate: <http://dbpedia.org/ontology/netIncome>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Unison_Networks> <http://dbpedia.org/ontology/netIncome> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Comcast> ; Predicate: <http://dbpedia.org/ontology/netIncome>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Comcast> <http://dbpedia.org/ontology/netIncome> ?object }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Comcast> ; Predicate: <http://dbpedia.org/property/parent>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/property/parent> <http://dbpedia.org/resource/Comcast> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Comcast> ; Predicate: <http://dbpedia.org/ontology/broadcastNetwork>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/broadcastNetwork> <http://dbpedia.org/resource/Comcast> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Comcast> ; Predicate: <http://dbpedia.org/property/network>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/property/network> <http://dbpedia.org/resource/Comcast> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Comcast> ; Predicate: <http://dbpedia.org/ontology/parentOrganisation>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/parentOrganisation> <http://dbpedia.org/resource/Comcast> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Comcast> ; Predicate: <http://dbpedia.org/ontology/network>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Comcast> }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Comcast_Business> ; Predicate: <http://dbpedia.org/property/parent>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Comcast_Business> <http://dbpedia.org/property/parent> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Comcast_Television> ; Predicate: <http://dbpedia.org/ontology/broadcastArea>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Comcast_Television> <http://dbpedia.org/ontology/broadcastArea> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Comcast_Television> ; Predicate: <http://dbpedia.org/property/broadcastArea>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Comcast_Television> <http://dbpedia.org/property/broadcastArea> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/The_Comcast_Network> ; Predicate: <http://dbpedia.org/ontology/broadcastArea>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/The_Comcast_Network> <http://dbpedia.org/ontology/broadcastArea> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/The_Comcast_Network> ; Predicate: <http://dbpedia.org/property/broadcastArea>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/The_Comcast_Network> <http://dbpedia.org/property/broadcastArea> ?object }\\n```\\n\\n### Object: <http://dbpedia.org/resource/The_Comcast_Network> ; Predicate: <http://dbpedia.org/ontology/broadcastNetwork>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/broadcastNetwork> <http://dbpedia.org/resource/The_Comcast_Network> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/The_Comcast_Network> ; Predicate: <http://dbpedia.org/ontology/network>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/The_Comcast_Network> }\\n```\\n\\n### Object: <http://dbpedia.org/resource/The_Comcast_Network> ; Predicate: <http://dbpedia.org/property/network>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/property/network> <http://dbpedia.org/resource/The_Comcast_Network> }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Comcast_Interactive_Media> ; Predicate: <http://dbpedia.org/property/parent>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Comcast_Interactive_Media> <http://dbpedia.org/property/parent> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Comcast_Cable> ; Predicate: <http://dbpedia.org/property/parent>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Comcast_Cable> <http://dbpedia.org/property/parent> ?object }\\n```\\n\\n### Object: <http://dbpedia.org/resource/Comcast_Cable> ; Predicate: <http://dbpedia.org/property/parent>\\n\\n```sparql\\nSELECT DISTINCT ?subject WHERE { ?subject <http://dbpedia.org/property/parent> <http://dbpedia.org/resource/Comcast_Cable> }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Comcast_Spotlight> ; Predicate: <http://dbpedia.org/property/parent>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Comcast_Spotlight> <http://dbpedia.org/property/parent> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Comcast_C2_Charleston> ; Predicate: <http://dbpedia.org/ontology/broadcastNetwork>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Comcast_C2_Charleston> <http://dbpedia.org/ontology/broadcastNetwork> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/Parent-Craft> ; Predicate: <http://dbpedia.org/ontology/network>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/Parent-Craft> <http://dbpedia.org/ontology/network> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/The_Parent_Game> ; Predicate: <http://dbpedia.org/ontology/network>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/The_Parent_Game> <http://dbpedia.org/ontology/network> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/The_Parent_Game> ; Predicate: <http://dbpedia.org/property/network>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/The_Parent_Game> <http://dbpedia.org/property/network> ?object }\\n```\\n\\nOf the ones given, which predicates will be useful to solve it?\\n\\nConsider it's better to query directly on IRIs and avoid filtering whenever possible. DO NOT generate any query yet.\\n\"}, {\"actor\": \"assistant\", \"text\": \"These are the predicates useful to solve this query:\\n- Through predicate <http://dbpedia.org/ontology/parentOrganisation> to object <http://dbpedia.org/resource/Comcast>\\n- Through predicate <http://dbpedia.org/ontology/network> to object <http://dbpedia.org/resource/Comcast>\\n\"}, {\"actor\": \"user\", \"text\": \"What are the subject IRIs that will be handy to solve this query? STILL DO NOT generate any query yet.\"}, {\"actor\": \"assistant\", \"text\": \"These are the IRIs useful to solve this query:\\n- http://dbpedia.org/ontology/parentOrganisation\\n- http://dbpedia.org/resource/Comcast\\n- http://dbpedia.org/ontology/network\\n\"}, {\"actor\": \"user\", \"text\": \"\\nConstruct a SPARQL query to solve it on a single query, keep it simple and avoid unnecessary conditions. If it's an item list just do a SELECT, but if it's numeric you might need to use a verb like COUNT(), and if it's boolean you might need to use ASK.\\n\\nRemember to avoid querying by label, use the IRIs and relations presented before, not others. DO NOT even use common types like `name` or `type` unless they were explicitly allowed.\\n\\nQuery to solve:\\n> Whose network's parent organisation is Comcast?\"}, {\"actor\": \"assistant\", \"text\": \"```sparql\\nSELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/parentOrganisation> <http://dbpedia.org/resource/Comcast> . ?uri <http://dbpedia.org/ontology/network> ?x  . }\\n```\"}]}\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "dataset['train'][0]"
      ],
      "metadata": {
        "id": "I6ZrpbqtsUap",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "a2cd1a90-67ec-4de5-e683-ca356387eecf"
      },
      "id": "I6ZrpbqtsUap",
      "execution_count": 20,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "{'messages': [{'actor': 'user',\n",
              "   'text': 'Extract the nouns from this natural language query.\\n\\n> What is the allegiance of John Kotelawala ?\\n\\nLet\\'s reason step by step. Identify the nouns on the query, skip the ones that can be solved by a SPARQL verb (ignore, for example, \"count\" or \"number of\"), and output a json list like this.\\n\\n```json\\n[\\n    \"entity1\",\\n    \"entity2\",\\n    ...\\n    \"entityN\"\\n]\\n```'},\n",
              "  {'actor': 'assistant',\n",
              "   'text': '```json\\n[\\n    \"allegiance\",\\n    \"John Kotelawala\"\\n]\\n```'},\n",
              "  {'actor': 'user',\n",
              "   'text': \"\\nThis are some examples on how the available properties can be used:\\n\\n### Subject: <http://dbpedia.org/resource/John_Kotelawala> ; Predicate: <http://dbpedia.org/property/allegiance>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/John_Kotelawala> <http://dbpedia.org/property/allegiance> ?object }\\n```\\n\\n### Subject: <http://dbpedia.org/resource/John_Kotelawala_Sr> ; Predicate: <http://dbpedia.org/ontology/stateOfOrigin>\\n\\n```sparql\\nSELECT DISTINCT ?object WHERE { <http://dbpedia.org/resource/John_Kotelawala_Sr> <http://dbpedia.org/ontology/stateOfOrigin> ?object }\\n```\\n\\nOf the ones given, which predicates will be useful to solve it?\\n\\nConsider it's better to query directly on IRIs and avoid filtering whenever possible. DO NOT generate any query yet.\\n\"},\n",
              "  {'actor': 'assistant',\n",
              "   'text': 'These are the predicates useful to solve this query:\\n- From subject <http://dbpedia.org/resource/John_Kotelawala>, through predicate <http://dbpedia.org/property/allegiance>\\n'},\n",
              "  {'actor': 'user',\n",
              "   'text': 'What are the subject IRIs that will be handy to solve this query? STILL DO NOT generate any query yet.'},\n",
              "  {'actor': 'assistant',\n",
              "   'text': 'These are the IRIs useful to solve this query:\\n- http://dbpedia.org/resource/John_Kotelawala\\n- http://dbpedia.org/property/allegiance\\n'},\n",
              "  {'actor': 'user',\n",
              "   'text': \"\\nConstruct a SPARQL query to solve it on a single query, keep it simple and avoid unnecessary conditions. If it's an item list just do a SELECT, but if it's numeric you might need to use a verb like COUNT(), and if it's boolean you might need to use ASK.\\n\\nRemember to avoid querying by label, use the IRIs and relations presented before, not others. DO NOT even use common types like `name` or `type` unless they were explicitly allowed.\\n\\nQuery to solve:\\n> What is the allegiance of John Kotelawala ?\"},\n",
              "  {'actor': 'assistant',\n",
              "   'text': '```sparql\\n SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Kotelawala> <http://dbpedia.org/property/allegiance> ?uri } \\n```'}]}"
            ]
          },
          "metadata": {},
          "execution_count": 20
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "%%time\n",
        "from transformers import set_seed\n",
        "seed = 42\n",
        "set_seed(seed)\n",
        "\n",
        "index = 0\n",
        "\n",
        "conversation = dataset['train'][index]\n",
        "\n",
        "import re\n",
        "\n",
        "PARSE_IM_RE = re.compile(r'<\\|im_start\\|>([^<]+)<\\|im_sep\\|>(([^<]|<[^|])*)<\\|im_end\\|>')\n",
        "\n",
        "# Generate output\n",
        "def gen(model, conversation, max_length, skip_last=True):\n",
        "    conversation_steps = []\n",
        "    for idx, step in enumerate(conversation['messages']):\n",
        "        # TODO: Check that these tokens are correct\n",
        "        if idx < (len(conversation['messages']) - 1) or not skip_last:\n",
        "          conversation_steps.append(f\"<|im_start|>{step['actor']}<|im_sep|>{step['text']}<|im_end|>\")\n",
        "        else:\n",
        "          assert step['actor'] == 'assistant'\n",
        "\n",
        "    inputs = tokenizer('\\n'.join(conversation_steps), return_tensors=\"pt\").to(model.device)\n",
        "    outputs = model.generate(**inputs, max_length=max_length)\n",
        "    return ''.join(tokenizer.batch_decode(outputs)).split('<|endoftext|>')[0] # , skip_special_tokens=True)\n",
        "\n",
        "def parse_out(output):\n",
        "  results = []\n",
        "  for chunk in PARSE_IM_RE.findall(output):\n",
        "    results.append((chunk[0], chunk[1]))\n",
        "  return results\n",
        "\n",
        "res = gen(model, conversation, 1000,)\n",
        "output = parse_out(res)\n",
        "\n",
        "dash_line = '-'.join('' for x in range(100))\n",
        "# print(f'INPUT PROMPT:\\n{formatted_prompt}')\n",
        "# print(dash_line)\n",
        "print(f'BASELINE OUTPUT:\\n{conversation[\"messages\"][-1][\"text\"]}\\n')\n",
        "print(dash_line)\n",
        "print(f'MODEL GENERATION - ZERO SHOT:\\n{output[-1][1]}')"
      ],
      "metadata": {
        "id": "xaYPgaN6sWOa",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "94ba8a05-6599-4342-d275-3c6871dd027c"
      },
      "id": "xaYPgaN6sWOa",
      "execution_count": 21,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "BASELINE OUTPUT:\n",
            "```sparql\n",
            " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Kotelawala> <http://dbpedia.org/property/allegiance> ?uri } \n",
            "```\n",
            "\n",
            "---------------------------------------------------------------------------------------------------\n",
            "MODEL GENERATION - ZERO SHOT:\n",
            "To construct a SPARQL query to find the allegiance of John Kotelawala using the provided IRIs and relations, you can use the following query:\n",
            "\n",
            "```sparql\n",
            "SELECT DISTINCT ?object WHERE {\n",
            "    <http://dbpedia.org/resource/John_Kotelawala> <http://dbpedia.org/property/allegiance> ?object\n",
            "}\n",
            "```\n",
            "\n",
            "This query selects the distinct objects that are linked to the subject `<http://dbpedia.org/resource/John_Kotelawala>` through the predicate `<http://dbpedia.org/property/allegiance>`.\n",
            "CPU times: user 8.22 s, sys: 303 ms, total: 8.53 s\n",
            "Wall time: 8.52 s\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "def create_prompt_formats(sample):\n",
        "    \"\"\"\n",
        "    Preparate a sample for prompt creation.\n",
        "    :param sample: Sample dictionnary\n",
        "    \"\"\"\n",
        "    batch = []\n",
        "    for conversation in sample['messages']:\n",
        "      conversation_steps = []\n",
        "      for step in conversation:\n",
        "          # TODO: Check that these tokens are correct\n",
        "          conversation_steps.append(f\"<|im_start|>{step['actor']}<|im_sep|>{step['text']}<|im_end|>\")\n",
        "      batch.append('\\n'.join(conversation_steps))\n",
        "    return {\"text\": batch}"
      ],
      "metadata": {
        "id": "OUiZcjj1saGB"
      },
      "id": "OUiZcjj1saGB",
      "execution_count": 22,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "from functools import partial\n",
        "\n",
        "# SOURCE https://github.com/databrickslabs/dolly/blob/master/training/trainer.py\n",
        "def get_max_length(model):\n",
        "    conf = model.config\n",
        "    max_length = None\n",
        "    for length_setting in [\"n_positions\", \"max_position_embeddings\", \"seq_length\"]:\n",
        "        max_length = getattr(model.config, length_setting, None)\n",
        "        if max_length:\n",
        "            print(f\"Found max lenth: {max_length}\")\n",
        "            break\n",
        "    if not max_length:\n",
        "        max_length = 1024\n",
        "        print(f\"Using default max length: {max_length}\")\n",
        "    return max_length\n",
        "\n",
        "\n",
        "def preprocess_batch(batch, tokenizer, max_length):\n",
        "    \"\"\"\n",
        "    Tokenizing a batch\n",
        "    \"\"\"\n",
        "    return tokenizer(\n",
        "        batch[\"text\"],\n",
        "        max_length=max_length,\n",
        "        truncation=True,\n",
        "    )\n",
        "\n",
        "# SOURCE https://github.com/databrickslabs/dolly/blob/master/training/trainer.py\n",
        "def preprocess_dataset(tokenizer: AutoTokenizer, max_length: int,seed, dataset):\n",
        "    \"\"\"Format & tokenize it so it is ready for training\n",
        "    :param tokenizer (AutoTokenizer): Model Tokenizer\n",
        "    :param max_length (int): Maximum number of tokens to emit from tokenizer\n",
        "    \"\"\"\n",
        "\n",
        "    # Add prompt to each sample\n",
        "    print(\"Preprocessing dataset...\")\n",
        "    dataset = dataset.map(create_prompt_formats, batched=True)\n",
        "    print(\"DS\", dataset)\n",
        "\n",
        "    # Apply preprocessing to each batch of the dataset & and remove 'instruction', 'context', 'response', 'category' fields\n",
        "    # _preprocessing_function = partial(preprocess_batch, max_length=max_length, tokenizer=tokenizer)\n",
        "    dataset = dataset.map(\n",
        "        # _preprocessing_function,\n",
        "        lambda x: tokenizer(x['text'], truncation=False, max_length=max_length),\n",
        "        batched=True,\n",
        "        # remove_columns=['user', 'assistant'],\n",
        "    )\n",
        "\n",
        "    # Filter out samples that have input_ids exceeding max_length\n",
        "    dataset = dataset.filter(lambda sample: len(sample[\"input_ids\"]) < max_length)\n",
        "\n",
        "    # Shuffle dataset\n",
        "    dataset = dataset.shuffle(seed=seed)\n",
        "\n",
        "    return dataset"
      ],
      "metadata": {
        "id": "7L9Iup-wscc6"
      },
      "id": "7L9Iup-wscc6",
      "execution_count": 23,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "## Pre-process dataset\n",
        "max_length = get_max_length(model)\n",
        "print(max_length)\n",
        "\n",
        "train_dataset = preprocess_dataset(tokenizer, max_length,seed, dataset['train'])\n",
        "eval_dataset = preprocess_dataset(tokenizer, max_length,seed, dataset['test'])"
      ],
      "metadata": {
        "id": "Fvx-1ZJxseaK",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 417,
          "referenced_widgets": [
            "abc52cb9eda14d1690f6d71f709afad7",
            "c1269094017e403ea5bfa3525f9041af",
            "baacb580b1cc45659504f05a91b4a200",
            "aca1950d405a44c8b402ebdc8324d294",
            "d7b74a8cf9eb40df976374493e61efbe",
            "eff73bb12cf8467c8b44358591527ef8",
            "a2fb2fc40811457890dcf39f7cee953c",
            "4aaef786774645de9bb94909280c1d77",
            "93b7ac94d332430aba1993a590bfb892",
            "e2cd0ee0b66a4273a4c930d94c13a217",
            "bb35983fe5c649f385792ef6a96acb6e",
            "992eae20099248e7aac4d6c9ae50c2f5",
            "ef4ff26897f8466cb9287384e3f4bbac",
            "87f0a13dbcbf4129a62bea4591d4fbe5",
            "69990576c4cf42c29ea68df36eb9bd0a",
            "39facff98d824a2da42e58e0f455dc73",
            "5e654410a4e84d62b253bdc45af937aa",
            "fa2454c6d97341d7abdc063b8135d627",
            "32a673fa266c48169dc896aeb6eaf8b7",
            "30c0e6e78dfe443e846d8758383ba9f6",
            "6ee85156e7014394987bacb1f9cc57b0",
            "5e87bfd4a2ec41f89085dca3c6ff0380",
            "692c00a05eca46ee9085d2dc95c0e812",
            "b062a16469554c1ca0a6a186f26f3457",
            "af66617840134c7cbb03e4b533119022",
            "2c298b186ea44da4a98bbe6e4fe867de",
            "5e63ba90c59d4c2893af0441c742eec0",
            "ec180679d1554a04b84b519ffe56265b",
            "4502cb30df564b438530de71d55b1777",
            "6101d263f44d46c29645477e01ded955",
            "9e45b94bed1d4d6e924e1a77cf60c7dc",
            "129316fec09d4404ad5f19c2b74587f6",
            "cfd46cf6c5f648b88da9129e35670bdc",
            "e05bdb40d0664f90965f024a5b94910b",
            "4242b44807d54a2484169139257109c1",
            "97ce2a4d3899455e9704de05eb5b9358",
            "12f60e58541c40e7a23f8ec7fefeb4d5",
            "076a71ac014d4c24b49b39eae6ee0edf",
            "832d289dd5ad4fc78bd16614164b60a9",
            "e2a418c17da74d84ab9e13406b03d0a6",
            "3186c1ebe63b43fd8ab1774d98048de0",
            "24e2b57abfb94d2595ea17f76666d898",
            "64d818dea31b46aebb600664f256e0aa",
            "e8350c36ba164525b299890aaf573a12",
            "ddc5594fca274628a44159763f0c8a51",
            "df3da35e1c2a44a1abb0ec16be29ec41",
            "f06074b500b9421fb5c38d6189c23100",
            "a792f46a75cc4b44a09840fb9162f9dc",
            "7303e81bff404b0cb2d2261f36e825fe",
            "80e940e87c8d40c6a8738272eb51ccd7",
            "164f940a897c426a9bf513f009176263",
            "c0988e2c7fce4dc4a7f207db427ede7c",
            "b728e8dc4a144747b774fdb61bc49f9e",
            "f7258da90f814653acfc9f320cb99f86",
            "bf8ddac6be124007bc78aea4d1c4e76a",
            "3c4e0e1bf76f400f848f196ec49bb6f8",
            "23a566023d4642c38e6577c6d3ae0638",
            "dfc50d890d374380a1202645bfb5d7a6",
            "528dec1f062a4c5bbc5033a9e0cd289e",
            "1351fbe752f54b89b74896c0bcd50fab",
            "2fad1b610bcc4e8fa8390b449dac3087",
            "572c32cbd868493fae2aa79d954e8714",
            "54431294ee984bc680539377677af398",
            "a16a5ed3dbb04720ac24fccafd85da47",
            "e12dd75591d742e5bca39965ef4c02eb",
            "b9520a0599c2498ab1d16f50c949216d"
          ]
        },
        "outputId": "bb10c696-2054-47b7-97be-606967f7c646"
      },
      "id": "Fvx-1ZJxseaK",
      "execution_count": 24,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Found max lenth: 16384\n",
            "16384\n",
            "Preprocessing dataset...\n"
          ]
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Map:   0%|          | 0/286 [00:00<?, ? examples/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "abc52cb9eda14d1690f6d71f709afad7"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "DS Dataset({\n",
            "    features: ['messages', 'text'],\n",
            "    num_rows: 286\n",
            "})\n"
          ]
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Map:   0%|          | 0/286 [00:00<?, ? examples/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "992eae20099248e7aac4d6c9ae50c2f5"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Filter:   0%|          | 0/286 [00:00<?, ? examples/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "692c00a05eca46ee9085d2dc95c0e812"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Preprocessing dataset...\n"
          ]
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Map:   0%|          | 0/10 [00:00<?, ? examples/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "e05bdb40d0664f90965f024a5b94910b"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "DS Dataset({\n",
            "    features: ['messages', 'text'],\n",
            "    num_rows: 10\n",
            "})\n"
          ]
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Map:   0%|          | 0/10 [00:00<?, ? examples/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "ddc5594fca274628a44159763f0c8a51"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Filter:   0%|          | 0/10 [00:00<?, ? examples/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "3c4e0e1bf76f400f848f196ec49bb6f8"
            }
          },
          "metadata": {}
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "model = FastLanguageModel.get_peft_model(\n",
        "    model,\n",
        "    r = 16, # Choose any number > 0 ! Suggested 8, 16, 32, 64, 128\n",
        "    target_modules = [\"q_proj\", \"k_proj\", \"v_proj\", \"o_proj\",\n",
        "                      \"gate_proj\", \"up_proj\", \"down_proj\",],\n",
        "    lora_alpha = 16,\n",
        "    lora_dropout = 0, # Supports any, but = 0 is optimized\n",
        "    bias = \"none\",    # Supports any, but = \"none\" is optimized\n",
        "    # [NEW] \"unsloth\" uses 30% less VRAM, fits 2x larger batch sizes!\n",
        "    use_gradient_checkpointing = \"unsloth\", # True or \"unsloth\" for very long context\n",
        "    random_state = 3407,\n",
        "    use_rslora = False,  # We support rank stabilized LoRA\n",
        "    loftq_config = None, # And LoftQ\n",
        ")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "YIPcJzBjOMez",
        "outputId": "59c3a361-3959-49e4-bfb6-f958a7cd4f24"
      },
      "id": "YIPcJzBjOMez",
      "execution_count": 25,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "Unsloth 2025.4.3 patched 40 layers with 40 QKV layers, 40 O layers and 40 MLP layers.\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# from peft import LoraConfig, get_peft_model, prepare_model_for_kbit_training"
      ],
      "metadata": {
        "id": "51xnl9xesgEX"
      },
      "id": "51xnl9xesgEX",
      "execution_count": 26,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# # 2 - Using the prepare_model_for_kbit_training method from PEFT\n",
        "# # Preparing the Model for QLoRA\n",
        "# original_model = prepare_model_for_kbit_training(original_model)"
      ],
      "metadata": {
        "id": "OyHC1nZ2shIo"
      },
      "id": "OyHC1nZ2shIo",
      "execution_count": 27,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# config = LoraConfig(\n",
        "#     r=32, # Rank\n",
        "#     lora_alpha=16,\n",
        "#     target_modules=[\n",
        "#         # \"q_proj\",  # Not found, ignored\n",
        "#         # \"k_proj\",  # Not found, ignored\n",
        "#         # \"v_proj\",  # Not found, ignored\n",
        "#         \"o_proj\",\n",
        "#         # \"gate_proj\", # Not found, ignored\n",
        "#         # \"up_proj\", # Not found, ignored\n",
        "#         \"down_proj\"\n",
        "#         ],\n",
        "#     bias=\"none\",\n",
        "#     lora_dropout=0.2,\n",
        "#     task_type=\"CAUSAL_LM\",\n",
        "# )\n",
        "\n",
        "# # 1 - Enabling gradient checkpointing to reduce memory usage during fine-tuning\n",
        "# original_model.gradient_checkpointing_enable()\n",
        "\n",
        "# peft_model = get_peft_model(original_model, config)"
      ],
      "metadata": {
        "id": "wX4ySk2xsiLB"
      },
      "id": "wX4ySk2xsiLB",
      "execution_count": 28,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "model.print_trainable_parameters()"
      ],
      "metadata": {
        "id": "6VmN9_bpsjxh",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "f9baa048-9239-463a-8c93-2d497db939ba"
      },
      "id": "6VmN9_bpsjxh",
      "execution_count": 29,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "trainable params: 65,536,000 || all params: 14,725,043,200 || trainable%: 0.4451\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "output_dir = f'./fine-tuned/peft-kbs-summary-training-{str(int(time.time()))}'\n",
        "import transformers\n",
        "\n",
        "LEARNING_RATE = 2e-4\n",
        "\n",
        "# MAX_STEPS = 1000\n",
        "MAX_STEPS = 100\n",
        "\n",
        "peft_training_args = TrainingArguments(\n",
        "    output_dir = output_dir,\n",
        "    warmup_steps=1,\n",
        "    per_device_train_batch_size=1, #\n",
        "    per_device_eval_batch_size=1, # same as above\n",
        "    gradient_accumulation_steps=1,\n",
        "    num_train_epochs=1,\n",
        "    # max_steps=MAX_STEPS, # If given a MAX_STEPS, not all data is trained\n",
        "    learning_rate=LEARNING_RATE,\n",
        "    optim=\"paged_adamw_8bit\",\n",
        "    save_steps=100, # For `load_best_model_at_end=True` must be same as `eval_steps`\n",
        "    eval_steps=100, # This is what takes most of the time! More steps between evals means faster training\n",
        "    do_eval=True,\n",
        "    logging_steps=25,\n",
        "    logging_dir=\"./logs\",\n",
        "    eval_strategy=\"steps\",\n",
        "    save_strategy=\"steps\",\n",
        "    load_best_model_at_end=True,\n",
        "    gradient_checkpointing=True,\n",
        "    report_to=\"wandb\",\n",
        "    overwrite_output_dir = 'True',\n",
        "    group_by_length=True,\n",
        ")\n",
        "\n",
        "model.config.use_cache = False\n",
        "\n",
        "peft_trainer = transformers.Trainer(\n",
        "    model=model,\n",
        "    train_dataset=train_dataset,\n",
        "    eval_dataset=eval_dataset,\n",
        "    args=peft_training_args,\n",
        "    data_collator=transformers.DataCollatorForLanguageModeling(tokenizer, mlm=False),\n",
        ")\n"
      ],
      "metadata": {
        "id": "zOfBzJcSsk7r"
      },
      "id": "zOfBzJcSsk7r",
      "execution_count": 30,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "res = peft_trainer.train()"
      ],
      "metadata": {
        "id": "XhAnDiqWsopC",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 356
        },
        "outputId": "9a61e3f2-5282-4c44-a463-febe281e1175"
      },
      "id": "XhAnDiqWsopC",
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "==((====))==  Unsloth - 2x faster free finetuning | Num GPUs used = 1\n",
            "   \\\\   /|    Num examples = 285 | Num Epochs = 1 | Total steps = 285\n",
            "O^O/ \\_/ \\    Batch size per device = 1 | Gradient accumulation steps = 1\n",
            "\\        /    Data Parallel GPUs = 1 | Total batch size (1 x 1 x 1) = 1\n",
            " \"-____-\"     Trainable parameters = 65,536,000/4,000,000,000 (1.64% trained)\n",
            "\u001b[34m\u001b[1mwandb\u001b[0m: \u001b[33mWARNING\u001b[0m The `run_name` is currently set to the same value as `TrainingArguments.output_dir`. If this was not intended, please specify a different run name by setting the `TrainingArguments.run_name` parameter.\n"
          ]
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "<IPython.core.display.HTML object>"
            ],
            "text/html": [
              "Changes to your `wandb` environment variables will be ignored because your `wandb` session has already started. For more information on how to modify your settings with `wandb.init()` arguments, please refer to <a href='https://wandb.me/wandb-init' target=\"_blank\">the W&B docs</a>."
            ]
          },
          "metadata": {}
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "<IPython.core.display.HTML object>"
            ],
            "text/html": [
              "Tracking run with wandb version 0.19.10"
            ]
          },
          "metadata": {}
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "<IPython.core.display.HTML object>"
            ],
            "text/html": [
              "Run data is saved locally in <code>/content/wandb/run-20250430_150554-b71psh01</code>"
            ]
          },
          "metadata": {}
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "<IPython.core.display.HTML object>"
            ],
            "text/html": [
              "Syncing run <strong><a href='https://wandb.ai/sergiomportela-universitat-oberta-de-catalunya/fine-tune-tfm-2025-tests/runs/b71psh01' target=\"_blank\">./fine-tuned/peft-kbs-summary-training-1746025551</a></strong> to <a href='https://wandb.ai/sergiomportela-universitat-oberta-de-catalunya/fine-tune-tfm-2025-tests' target=\"_blank\">Weights & Biases</a> (<a href='https://wandb.me/developer-guide' target=\"_blank\">docs</a>)<br>"
            ]
          },
          "metadata": {}
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "<IPython.core.display.HTML object>"
            ],
            "text/html": [
              " View project at <a href='https://wandb.ai/sergiomportela-universitat-oberta-de-catalunya/fine-tune-tfm-2025-tests' target=\"_blank\">https://wandb.ai/sergiomportela-universitat-oberta-de-catalunya/fine-tune-tfm-2025-tests</a>"
            ]
          },
          "metadata": {}
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "<IPython.core.display.HTML object>"
            ],
            "text/html": [
              " View run at <a href='https://wandb.ai/sergiomportela-universitat-oberta-de-catalunya/fine-tune-tfm-2025-tests/runs/b71psh01' target=\"_blank\">https://wandb.ai/sergiomportela-universitat-oberta-de-catalunya/fine-tune-tfm-2025-tests/runs/b71psh01</a>"
            ]
          },
          "metadata": {}
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "\u001b[34m\u001b[1mwandb\u001b[0m: \u001b[33mWARNING\u001b[0m The get_url method is deprecated and will be removed in a future release. Please use `run.url` instead.\n"
          ]
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "<IPython.core.display.HTML object>"
            ],
            "text/html": [
              "\n",
              "    <div>\n",
              "      \n",
              "      <progress value='14' max='285' style='width:300px; height:20px; vertical-align: middle;'></progress>\n",
              "      [ 14/285 00:31 < 11:49, 0.38 it/s, Epoch 0.05/1]\n",
              "    </div>\n",
              "    <table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              " <tr style=\"text-align: left;\">\n",
              "      <th>Step</th>\n",
              "      <th>Training Loss</th>\n",
              "      <th>Validation Loss</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "  </tbody>\n",
              "</table><p>"
            ]
          },
          "metadata": {}
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Unsloth: Will smartly offload gradients to save VRAM!\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Test results"
      ],
      "metadata": {
        "id": "IV8jEvtsstf9"
      },
      "id": "IV8jEvtsstf9"
    },
    {
      "cell_type": "code",
      "source": [
        "%%time\n",
        "from transformers import set_seed\n",
        "set_seed(seed)\n",
        "\n",
        "index = 3\n",
        "user = dataset['test'][index]['user']\n",
        "assistant = dataset['test'][index]['assistant']\n",
        "\n",
        "prompt = f\"Instruct: {user}\\n\\nOutput:\\n\"\n",
        "\n",
        "peft_model_res = gen(peft_model,prompt,1000,)\n",
        "peft_model_output = peft_model_res[0].split('Output:\\n')[1]\n",
        "#print(peft_model_output)\n",
        "prefix, success, result = peft_model_output.partition('###')\n",
        "\n",
        "dash_line = '-'.join('' for x in range(100))\n",
        "print(dash_line)\n",
        "print(f'INPUT PROMPT:\\n{prompt}')\n",
        "print(dash_line)\n",
        "print(f'BASELINE HUMAN SUMMARY:\\n{assistant}\\n')\n",
        "print(dash_line)\n",
        "print(f'PEFT MODEL:\\n{prefix}')"
      ],
      "metadata": {
        "id": "CIimEZxRsurD"
      },
      "id": "CIimEZxRsurD",
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Upload results"
      ],
      "metadata": {
        "id": "JuybOrBZYV6b"
      },
      "id": "JuybOrBZYV6b"
    },
    {
      "cell_type": "code",
      "source": [
        "!rsync -HPrz --mkpath \\\n",
        "  fine-tuned \\\n",
        "  result-pusher@kb.tfm.codigoparallevar.com:fine-tuning"
      ],
      "metadata": {
        "id": "otTphZSUYXN8"
      },
      "id": "otTphZSUYXN8",
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "id": "cdf303a7-cb4f-4bbe-96c8-e0f881eb1812",
      "metadata": {
        "id": "cdf303a7-cb4f-4bbe-96c8-e0f881eb1812"
      },
      "source": [
        "## Cleanup"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Finish time\n",
        "!date"
      ],
      "metadata": {
        "id": "y1ducQOZhKIm"
      },
      "id": "y1ducQOZhKIm",
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "id": "fceb9694-7dd1-4086-b87f-e449cb612682",
      "metadata": {
        "id": "fceb9694-7dd1-4086-b87f-e449cb612682"
      },
      "source": [
        "### Stop kernel"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "999aeb16-d251-4c00-93e6-977bc73ae1c1",
      "metadata": {
        "id": "999aeb16-d251-4c00-93e6-977bc73ae1c1"
      },
      "outputs": [],
      "source": [
        "# exit(0)"
      ]
    }
  ],
  "metadata": {
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.12.9"
    },
    "colab": {
      "provenance": [],
      "gpuType": "A100",
      "machine_shape": "hm"
    },
    "accelerator": "GPU",
    "widgets": {
      "application/vnd.jupyter.widget-state+json": {
        "b59be6e88db245678ec4619c637e9cdc": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_741e765697874f73844b1ea34d38e8e1",
              "IPY_MODEL_f94a0790662a4cb4a7343de003010e17",
              "IPY_MODEL_eaad1e2eaa5744d58a628e4ddd9c9c50"
            ],
            "layout": "IPY_MODEL_e136d8a5bbc24a6d8f4cf52b63ca5c8a"
          }
        },
        "741e765697874f73844b1ea34d38e8e1": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_f770eb5ba6d3488aa8830ea2baab22bf",
            "placeholder": "​",
            "style": "IPY_MODEL_dcafc58ae9c445f0b98d2c664d4de289",
            "value": "Loading checkpoint shards: 100%"
          }
        },
        "f94a0790662a4cb4a7343de003010e17": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_482dc54f84794b1097c93d1e91f1c12a",
            "max": 3,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_78d3f17bf3bf48e286ef04d29c7b36b7",
            "value": 3
          }
        },
        "eaad1e2eaa5744d58a628e4ddd9c9c50": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_66da8149c5f14337b6e5d4d4a8a0b48d",
            "placeholder": "​",
            "style": "IPY_MODEL_791594b027314e2180eb125f1d9ce83e",
            "value": " 3/3 [00:03&lt;00:00,  1.03s/it]"
          }
        },
        "e136d8a5bbc24a6d8f4cf52b63ca5c8a": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "f770eb5ba6d3488aa8830ea2baab22bf": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "dcafc58ae9c445f0b98d2c664d4de289": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "482dc54f84794b1097c93d1e91f1c12a": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "78d3f17bf3bf48e286ef04d29c7b36b7": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "66da8149c5f14337b6e5d4d4a8a0b48d": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "791594b027314e2180eb125f1d9ce83e": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "29edc8919f3f4508b706ee040d230da1": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_86eb63275eec4405bc6d2d265c0d0651",
              "IPY_MODEL_312178a3e0be4e04acfcdd256053252b",
              "IPY_MODEL_80bc44fe9c47426dabbe57919a03ca7f"
            ],
            "layout": "IPY_MODEL_b605171f7b6644feb8a4222ab922e844"
          }
        },
        "86eb63275eec4405bc6d2d265c0d0651": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_536d78c7ef6f4dafbcb3af2fed46aacc",
            "placeholder": "​",
            "style": "IPY_MODEL_b956e7445db6496d848a3193b1af10c7",
            "value": "Generating test split: "
          }
        },
        "312178a3e0be4e04acfcdd256053252b": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_5e8950be6de84bb8a4e55b3f80ab764e",
            "max": 1,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_f4e068f92f8448058b488e7d25f14dbf",
            "value": 1
          }
        },
        "80bc44fe9c47426dabbe57919a03ca7f": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_e9f73c258ffb43e693c523578c427a6c",
            "placeholder": "​",
            "style": "IPY_MODEL_136c13d5ff7a4e9c874a9a234d3bc7c3",
            "value": " 10/0 [00:00&lt;00:00, 709.32 examples/s]"
          }
        },
        "b605171f7b6644feb8a4222ab922e844": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "536d78c7ef6f4dafbcb3af2fed46aacc": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "b956e7445db6496d848a3193b1af10c7": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "5e8950be6de84bb8a4e55b3f80ab764e": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": "20px"
          }
        },
        "f4e068f92f8448058b488e7d25f14dbf": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "e9f73c258ffb43e693c523578c427a6c": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "136c13d5ff7a4e9c874a9a234d3bc7c3": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "532fbd7cc9d34e2abb98950f8b39c8d1": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_46528b8a27904a8283bc88141cca02a6",
              "IPY_MODEL_c79731c2874e44f8a0d8c8cd47d6840f",
              "IPY_MODEL_4aa14555124648b7b090588bb1690adf"
            ],
            "layout": "IPY_MODEL_b818c08cf0204bceb753f602a916e3ae"
          }
        },
        "46528b8a27904a8283bc88141cca02a6": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_61f8212b29f84c4ca3a243b28225dff7",
            "placeholder": "​",
            "style": "IPY_MODEL_75b389d9c72f45f9867c5b7684daa79d",
            "value": "Generating train split: "
          }
        },
        "c79731c2874e44f8a0d8c8cd47d6840f": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_3512c99839914007bc797ca42bc56679",
            "max": 1,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_5dca594db99149c18cfff758015fa961",
            "value": 1
          }
        },
        "4aa14555124648b7b090588bb1690adf": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_f4e7b58fcfc74158b8b80d9273d41958",
            "placeholder": "​",
            "style": "IPY_MODEL_45b2c256eb1640eda8d91db0a529cf4b",
            "value": " 286/0 [00:00&lt;00:00, 13097.18 examples/s]"
          }
        },
        "b818c08cf0204bceb753f602a916e3ae": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "61f8212b29f84c4ca3a243b28225dff7": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "75b389d9c72f45f9867c5b7684daa79d": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "3512c99839914007bc797ca42bc56679": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": "20px"
          }
        },
        "5dca594db99149c18cfff758015fa961": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "f4e7b58fcfc74158b8b80d9273d41958": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "45b2c256eb1640eda8d91db0a529cf4b": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "abc52cb9eda14d1690f6d71f709afad7": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_c1269094017e403ea5bfa3525f9041af",
              "IPY_MODEL_baacb580b1cc45659504f05a91b4a200",
              "IPY_MODEL_aca1950d405a44c8b402ebdc8324d294"
            ],
            "layout": "IPY_MODEL_d7b74a8cf9eb40df976374493e61efbe"
          }
        },
        "c1269094017e403ea5bfa3525f9041af": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_eff73bb12cf8467c8b44358591527ef8",
            "placeholder": "​",
            "style": "IPY_MODEL_a2fb2fc40811457890dcf39f7cee953c",
            "value": "Map: 100%"
          }
        },
        "baacb580b1cc45659504f05a91b4a200": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_4aaef786774645de9bb94909280c1d77",
            "max": 286,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_93b7ac94d332430aba1993a590bfb892",
            "value": 286
          }
        },
        "aca1950d405a44c8b402ebdc8324d294": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_e2cd0ee0b66a4273a4c930d94c13a217",
            "placeholder": "​",
            "style": "IPY_MODEL_bb35983fe5c649f385792ef6a96acb6e",
            "value": " 286/286 [00:00&lt;00:00, 5441.76 examples/s]"
          }
        },
        "d7b74a8cf9eb40df976374493e61efbe": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "eff73bb12cf8467c8b44358591527ef8": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "a2fb2fc40811457890dcf39f7cee953c": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "4aaef786774645de9bb94909280c1d77": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "93b7ac94d332430aba1993a590bfb892": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "e2cd0ee0b66a4273a4c930d94c13a217": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "bb35983fe5c649f385792ef6a96acb6e": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "992eae20099248e7aac4d6c9ae50c2f5": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_ef4ff26897f8466cb9287384e3f4bbac",
              "IPY_MODEL_87f0a13dbcbf4129a62bea4591d4fbe5",
              "IPY_MODEL_69990576c4cf42c29ea68df36eb9bd0a"
            ],
            "layout": "IPY_MODEL_39facff98d824a2da42e58e0f455dc73"
          }
        },
        "ef4ff26897f8466cb9287384e3f4bbac": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_5e654410a4e84d62b253bdc45af937aa",
            "placeholder": "​",
            "style": "IPY_MODEL_fa2454c6d97341d7abdc063b8135d627",
            "value": "Map: 100%"
          }
        },
        "87f0a13dbcbf4129a62bea4591d4fbe5": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_32a673fa266c48169dc896aeb6eaf8b7",
            "max": 286,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_30c0e6e78dfe443e846d8758383ba9f6",
            "value": 286
          }
        },
        "69990576c4cf42c29ea68df36eb9bd0a": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_6ee85156e7014394987bacb1f9cc57b0",
            "placeholder": "​",
            "style": "IPY_MODEL_5e87bfd4a2ec41f89085dca3c6ff0380",
            "value": " 286/286 [00:00&lt;00:00, 501.43 examples/s]"
          }
        },
        "39facff98d824a2da42e58e0f455dc73": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "5e654410a4e84d62b253bdc45af937aa": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "fa2454c6d97341d7abdc063b8135d627": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "32a673fa266c48169dc896aeb6eaf8b7": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "30c0e6e78dfe443e846d8758383ba9f6": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "6ee85156e7014394987bacb1f9cc57b0": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "5e87bfd4a2ec41f89085dca3c6ff0380": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "692c00a05eca46ee9085d2dc95c0e812": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_b062a16469554c1ca0a6a186f26f3457",
              "IPY_MODEL_af66617840134c7cbb03e4b533119022",
              "IPY_MODEL_2c298b186ea44da4a98bbe6e4fe867de"
            ],
            "layout": "IPY_MODEL_5e63ba90c59d4c2893af0441c742eec0"
          }
        },
        "b062a16469554c1ca0a6a186f26f3457": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_ec180679d1554a04b84b519ffe56265b",
            "placeholder": "​",
            "style": "IPY_MODEL_4502cb30df564b438530de71d55b1777",
            "value": "Filter: 100%"
          }
        },
        "af66617840134c7cbb03e4b533119022": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_6101d263f44d46c29645477e01ded955",
            "max": 286,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_9e45b94bed1d4d6e924e1a77cf60c7dc",
            "value": 286
          }
        },
        "2c298b186ea44da4a98bbe6e4fe867de": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_129316fec09d4404ad5f19c2b74587f6",
            "placeholder": "​",
            "style": "IPY_MODEL_cfd46cf6c5f648b88da9129e35670bdc",
            "value": " 286/286 [00:00&lt;00:00, 428.69 examples/s]"
          }
        },
        "5e63ba90c59d4c2893af0441c742eec0": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "ec180679d1554a04b84b519ffe56265b": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "4502cb30df564b438530de71d55b1777": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "6101d263f44d46c29645477e01ded955": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "9e45b94bed1d4d6e924e1a77cf60c7dc": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "129316fec09d4404ad5f19c2b74587f6": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "cfd46cf6c5f648b88da9129e35670bdc": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "e05bdb40d0664f90965f024a5b94910b": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_4242b44807d54a2484169139257109c1",
              "IPY_MODEL_97ce2a4d3899455e9704de05eb5b9358",
              "IPY_MODEL_12f60e58541c40e7a23f8ec7fefeb4d5"
            ],
            "layout": "IPY_MODEL_076a71ac014d4c24b49b39eae6ee0edf"
          }
        },
        "4242b44807d54a2484169139257109c1": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_832d289dd5ad4fc78bd16614164b60a9",
            "placeholder": "​",
            "style": "IPY_MODEL_e2a418c17da74d84ab9e13406b03d0a6",
            "value": "Map: 100%"
          }
        },
        "97ce2a4d3899455e9704de05eb5b9358": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_3186c1ebe63b43fd8ab1774d98048de0",
            "max": 10,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_24e2b57abfb94d2595ea17f76666d898",
            "value": 10
          }
        },
        "12f60e58541c40e7a23f8ec7fefeb4d5": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_64d818dea31b46aebb600664f256e0aa",
            "placeholder": "​",
            "style": "IPY_MODEL_e8350c36ba164525b299890aaf573a12",
            "value": " 10/10 [00:00&lt;00:00, 665.85 examples/s]"
          }
        },
        "076a71ac014d4c24b49b39eae6ee0edf": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "832d289dd5ad4fc78bd16614164b60a9": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "e2a418c17da74d84ab9e13406b03d0a6": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "3186c1ebe63b43fd8ab1774d98048de0": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "24e2b57abfb94d2595ea17f76666d898": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "64d818dea31b46aebb600664f256e0aa": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "e8350c36ba164525b299890aaf573a12": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "ddc5594fca274628a44159763f0c8a51": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_df3da35e1c2a44a1abb0ec16be29ec41",
              "IPY_MODEL_f06074b500b9421fb5c38d6189c23100",
              "IPY_MODEL_a792f46a75cc4b44a09840fb9162f9dc"
            ],
            "layout": "IPY_MODEL_7303e81bff404b0cb2d2261f36e825fe"
          }
        },
        "df3da35e1c2a44a1abb0ec16be29ec41": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_80e940e87c8d40c6a8738272eb51ccd7",
            "placeholder": "​",
            "style": "IPY_MODEL_164f940a897c426a9bf513f009176263",
            "value": "Map: 100%"
          }
        },
        "f06074b500b9421fb5c38d6189c23100": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_c0988e2c7fce4dc4a7f207db427ede7c",
            "max": 10,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_b728e8dc4a144747b774fdb61bc49f9e",
            "value": 10
          }
        },
        "a792f46a75cc4b44a09840fb9162f9dc": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_f7258da90f814653acfc9f320cb99f86",
            "placeholder": "​",
            "style": "IPY_MODEL_bf8ddac6be124007bc78aea4d1c4e76a",
            "value": " 10/10 [00:00&lt;00:00, 155.81 examples/s]"
          }
        },
        "7303e81bff404b0cb2d2261f36e825fe": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "80e940e87c8d40c6a8738272eb51ccd7": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "164f940a897c426a9bf513f009176263": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "c0988e2c7fce4dc4a7f207db427ede7c": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "b728e8dc4a144747b774fdb61bc49f9e": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "f7258da90f814653acfc9f320cb99f86": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "bf8ddac6be124007bc78aea4d1c4e76a": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "3c4e0e1bf76f400f848f196ec49bb6f8": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_23a566023d4642c38e6577c6d3ae0638",
              "IPY_MODEL_dfc50d890d374380a1202645bfb5d7a6",
              "IPY_MODEL_528dec1f062a4c5bbc5033a9e0cd289e"
            ],
            "layout": "IPY_MODEL_1351fbe752f54b89b74896c0bcd50fab"
          }
        },
        "23a566023d4642c38e6577c6d3ae0638": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_2fad1b610bcc4e8fa8390b449dac3087",
            "placeholder": "​",
            "style": "IPY_MODEL_572c32cbd868493fae2aa79d954e8714",
            "value": "Filter: 100%"
          }
        },
        "dfc50d890d374380a1202645bfb5d7a6": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_54431294ee984bc680539377677af398",
            "max": 10,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_a16a5ed3dbb04720ac24fccafd85da47",
            "value": 10
          }
        },
        "528dec1f062a4c5bbc5033a9e0cd289e": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_e12dd75591d742e5bca39965ef4c02eb",
            "placeholder": "​",
            "style": "IPY_MODEL_b9520a0599c2498ab1d16f50c949216d",
            "value": " 10/10 [00:00&lt;00:00, 204.56 examples/s]"
          }
        },
        "1351fbe752f54b89b74896c0bcd50fab": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "2fad1b610bcc4e8fa8390b449dac3087": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "572c32cbd868493fae2aa79d954e8714": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "54431294ee984bc680539377677af398": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "a16a5ed3dbb04720ac24fccafd85da47": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "e12dd75591d742e5bca39965ef4c02eb": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "b9520a0599c2498ab1d16f50c949216d": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        }
      }
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}